In [1]:
import pandas as pd
import mysql.connector

Es el momento de meter todos nuestros datos en SQL 游눩游낗!!! En este ejercicio nos crearemos dos tablas en una BBDD creada por nosotras. Una de las tablas contendr치 la informaci칩n que obtuvimos de los ejercicios de pair programming de Limpieza, es decir, el data set de ataques de tiburones limpito. La segunda tabla tendr치 la informaci칩n obtenida en el ejercicio de pair de ETL 1.

1- Cread la BBDD con el nombre de tiburones.

In [2]:
df_ataques = pd.read_csv('../Ficheros/attack_limpieza5.csv', index_col= 0)
df_clima = pd.read_csv('../Ficheros/ETL1.csv', index_col= 0)

In [3]:
df_ataques.head(3)

,case_number,year,country,activity,age,species_,date,mes,fatal_,sex2,nuevas_edades
0,1800.00.00,1977,seychelles,a corsair's boat was overturned,NaN,NaN,1800,NaN,y,F,27.301694
1,1797.05.28.R,1977,NaN,Dropped overboard,NaN,NaN,Reported May-28-1797,May,y,M,27.301694
2,1792.09.12,1977,england,Fishing,NaN,NaN,12-Sep-1792,Sep,y,M,27.301694

In [4]:
df_ataques["activity"] = df_ataques["activity"].apply(lambda x:x.replace("'", ""))

In [5]:
df_ataques.dtypes

case_number       object
year               int64
country           object
activity          object
age               object
species_          object
date              object
mes               object
fatal_            object
sex2              object
nuevas_edades    float64
dtype: object

In [6]:
df_ataques.isnull().sum()

case_number         1
year                0
country            50
activity            0
age              2820
species_         2831
date                0
mes               570
fatal_            607
sex2                0
nuevas_edades       0
dtype: int64

In [7]:
df_clima.head(1)

,timepoint,cloudcover,highcloud,midcloud,lowcloud,rh_profile,wind_profile,temp2m,lifted_index,rh2m,msl_pressure,prec_type,prec_amount,snow_depth,wind10m.direction,wind10m.speed,latitud,longitud,paises
0,3,1,-9999,-9999,-9999,"[{'layer': '950mb', 'rh': 2}, {'layer': '900mb...","[{'layer': '950mb', 'direction': 5, 'speed': 2...",26,6,3,1009,none,0,0,295,2,39.78373,-100.445882,USA

In [10]:
df_clima.dtypes

timepoint              int64
cloudcover             int64
highcloud              int64
midcloud               int64
lowcloud               int64
rh_profile            object
wind_profile          object
temp2m                 int64
lifted_index           int64
rh2m                   int64
msl_pressure           int64
prec_type             object
prec_amount            int64
snow_depth             int64
wind10m.direction      int64
wind10m.speed          int64
latitud              float64
longitud             float64
paises                object
dtype: object

In [11]:
df_clima.isnull().sum()

timepoint            0
cloudcover           0
highcloud            0
midcloud             0
lowcloud             0
rh_profile           0
wind_profile         0
temp2m               0
lifted_index         0
rh2m                 0
msl_pressure         0
prec_type            0
prec_amount          0
snow_depth           0
wind10m.direction    0
wind10m.speed        0
latitud              0
longitud             0
paises               0
dtype: int64

In [8]:
def crear_bbdd(nombre_bbdd):

    mydb = mysql.connector.connect(
      host="localhost",
      user="root",
      password="AlumnaAdalab" # aqu칤 tendr칠is que poner vuestra contrase침a de MySQL
    )
    print("Conexi칩n realizada con 칠xito")
    
    mycursor = mydb.cursor()

    try:
        mycursor.execute(f"CREATE DATABASE IF NOT EXISTS {nombre_bbdd};")
        print(mycursor)
    except mysql.connector.Error as err:
        print(err)
        print("Error Code:", err.errno)
        print("SQLSTATE", err.sqlstate)
        print("Message", err.msg)

In [9]:
mydb = crear_bbdd("tiburones")

Conexi칩n realizada con 칠xito
MySQLCursor: CREATE DATABASE IF NOT EXISTS tiburones;

2- Cread las tablas de la BBDD: tabla ataques, tabla clima

In [30]:
def crear_insertar_tabla(nombre_bbdd, contrase침a, query):
    
    # nos conectamsos con el servidor usando el conector de sql
    cnx = mysql.connector.connect(user='root', password=f"{contrase침a}",
                                     host='127.0.0.1', database=f"{nombre_bbdd}")
    # iniciamos el cursor
    mycursor = cnx.cursor()
    
    # intentamos hacer la query
    try: 
        mycursor.execute(query)
        cnx.commit() 
    # en caso de que podamos ejecutar la query devuelvenos un error para saber en que nos estamos equivocando
    except mysql.connector.Error as err:
        print(err)
        print("Error Code:", err.errno)
        print("SQLSTATE", err.sqlstate)
        print("Message", err.msg)

In [31]:
tabla_clima = """ CREATE TABLE IF NOT EXISTS clima (
  idclima INT NOT NULL AUTO_INCREMENT,
  timepoint INT NOT NULL,
  cloudcover INT NOT NULL,
  highcloud INT NOT NULL,
  midcloud  INT NOT NULL,
  lowcloud  INT NOT NULL,
  rh_profile VARCHAR(255) NOT NULL,
  wind_profile VARCHAR(255) NOT NULL,
  temp2m INT NOT NULL,
  lifted_index INT NOT NULL,
  rh2m INT NOT NULL,
  msl_pressure INT NOT NULL, 
  prec_type VARCHAR(255) NOT NULL,
  prec_amounT INT NOT NULL,
  snow_depth INT NOT NULL,
  wind10m_direction INT NOT NULL,
  wind10m_speed INT NOT NULL,
  latitud FLOAT NOT NULL,
  longitud FLOAT NOT NULL,
  paises VARCHAR(255) NOT NULL,
  PRIMARY KEY (idclima))"""

In [32]:
df_ataques.head()

,case_number,year,country,activity,age,species_,date,mes,fatal_,sex2,nuevas_edades
0,1800.00.00,1977,seychelles,a corsairs boat was overturned,NaN,NaN,1800,NaN,y,F,27.301694
1,1797.05.28.R,1977,NaN,Dropped overboard,NaN,NaN,Reported May-28-1797,May,y,M,27.301694
2,1792.09.12,1977,england,Fishing,NaN,NaN,12-Sep-1792,Sep,y,M,27.301694
3,1791.00.00,1977,australia,Surfing,NaN,NaN,1791,NaN,y,F,27.301694
4,1788.05.10,1977,australia,Fishing,NaN,NaN,10-May-1788,May,n,M,27.301694

In [33]:
tabla_ataques = """ CREATE TABLE IF NOT EXISTS ataques (
  case_number VARCHAR(255) NOT NULL,
  year INT NOT NULL,
  country VARCHAR(255),
  age VARCHAR(255),
  species_ VARCHAR(255),
  fatal_ VARCHAR(255),
  sex2 VARCHAR(255) NOT NULL,  
  nuevas_edades FLOAT NOT NULL,
  PRIMARY KEY (case_number))"""

In [34]:
crear_insertar_tabla("tiburones", "AlumnaAdalab", tabla_clima)

In [35]:
crear_insertar_tabla("tiburones", "AlumnaAdalab", tabla_ataques)

3- BONUS Insertar los datos en las tablas.

In [36]:
for indice, fila in df_ataques.iterrows(): # itreamos por el dataframe
        
        query_ataques = f"""
                INSERT INTO ataques (case_number, year, country, age, species_, fatal_, sex2, nuevas_edades) 
                VALUES ( "{fila["case_number"]}","{fila['year']}", "{fila['country']}", "{fila['age']}", "{fila['species_']}","{fila['fatal_']}","{fila['sex2']}","{fila['nuevas_edades']}");
                """

    # una vez definida la query llamamos a la funci칩n que nos inserta los datos. 
        
        crear_insertar_tabla("tiburones", "AlumnaAdalab", query_ataques)

1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'middle-age"", "nan","y","F","27.301693925233646")' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'middle-age"", "nan","y","F","27.301693925233646")' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'young"", "Unspecified","n","M","27.301693925233646")' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'young"", "Unspecified","n","M","27.301693925233646")' at line 2

In [ ]:
for indice, fila in df_clima.iterrows(): # itreamos por el dataframe
        
        query_clima = f"""
                INSERT INTO ataques (case_number, year, country, age, species_, fatal_, sex2, nuevas_edades) 
                VALUES ( "{fila["case_number"]}","{fila['year']}", "{fila['country']}", "{fila['age']}", "{fila['species_']}","{fila['fatal_']}","{fila['sex2']}","{fila['nuevas_edades']}");
                """

    # una vez definida la query llamamos a la funci칩n que nos inserta los datos. 
        
        crear_insertar_tabla("tiburones", "AlumnaAdalab", query_ataques)

In [ ]:
## tabla_ataques = """ CREATE TABLE IF NOT EXISTS ataques (
  case_number VARCHAR(255) NOT NULL,
  year INT NOT NULL,
  country VARCHAR(255),
  activity VARCHAR(255) NOT NULL,
  age VARCHAR(255),
  species_ VARCHAR(255),
  date VARCHAR(255) NOT NULL,
  mes VARCHAR(255) ,
  fatal_ VARCHAR(255),
  sex2 VARCHAR(255) NOT NULL,  
  nuevas_edades FLOAT NOT NULL,
  PRIMARY KEY (case_number))"""

In [ ]:
### for indice, fila in df_ataques.iterrows(): # itreamos por el dataframe
        
        query_ataques = f"""
                INSERT INTO ataques (case_number, year, country, activity, age, species_, date, mes, fatal_, sex2, nuevas_edades) 
                VALUES ( "{fila["case_number"]}","{fila['year']}", "{fila['country']}", "{fila['activity']}", "{fila['age']}", "{fila['species_']}", \
                        "{fila['date']}","{fila['mes']}","{fila['fatal_']}","{fila['sex2']}","{fila['nuevas_edades']}");
                """

    # una vez definida la query llamamos a la funci칩n que nos inserta los datos. 
        
        crear_insertar_tabla("tiburones", "AlumnaAdalab", query_ataques)